<a href="https://colab.research.google.com/github/harshitagarge/DSBDA/blob/main/3374SL6_PR.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Problem 4 : Write down the code for following output**

In [ ]:
import pandas as pd
import numpy as np
data = {'a' : 0.,'b' : 1., 'c' : 2. }
s = pd.Series(data)
print (s)

a    0.0
b    1.0
c    2.0
dtype: float64

**Problem Statement 3: Create a Data Frame of your family with column name as Name, Relation, Age, Birth date for minimum 10 records. Perform the following operations on data frame 1) Display of Data Frame 2) Ascending Order Sorting of Name 3) Descending Order Sorting of Age 4) Copy the Data Frame to another Data Frame**

In [ ]:
import pandas as pd
data = [['Harshita', 'Self', 21, '22 August 1999'],
        ['Kishor', 'Father', 62, '11 July 1957'],
        ['Vandana', 'Mother', 54, '30 August 1965'],
        ['Anushree', 'Sister-in-law', 25, '5 April 1997'],
        ['Ashish', 'Brother', 30, '23 April 1989'],
        ['Suman', 'Grandmother', 80, '21 November 1942'],
        ['Harshita', 'Self', 20, '22 August 1999'],
        ['Harshita', 'Self', 20, '22 August 1999'],
        ['Harshita', 'Self', 20, '22 August 1999'],
        ['Harshita', 'Self', 20, '22 August 1999']]
df = pd.DataFrame(data, columns = ['Name', 'Relation', 'Age', 'Birthdate'])
print(df)
print(df.sort_values(by='Name', axis= 0, ascending= True))
print(df.sort_values(by='Age', axis= 0, ascending= False))
new_df = pd.DataFrame.copy(df)
print(new_df)

       Name       Relation  Age         Birthdate
0  Harshita           Self   21    22 August 1999
1    Kishor         Father   62      11 July 1957
2   Vandana         Mother   54    30 August 1965
3  Anushree  Sister-in-law   25      5 April 1997
4    Ashish        Brother   30     23 April 1989
5     Suman    Grandmother   80  21 November 1942
6  Harshita           Self   20    22 August 1999
7  Harshita           Self   20    22 August 1999
8  Harshita           Self   20    22 August 1999
9  Harshita           Self   20    22 August 1999
       Name       Relation  Age         Birthdate
3  Anushree  Sister-in-law   25      5 April 1997
4    Ashish        Brother   30     23 April 1989
0  Harshita           Self   21    22 August 1999
6  Harshita           Self   20    22 August 1999
7  Harshita           Self   20    22 August 1999
8  Harshita           Self   20    22 August 1999
9  Harshita           Self   20    22 August 1999
1    Kishor         Father   62      11 July 1957
5     Suman    Grandmother   80  21 November 1942
2   Vandana         Mother   54    30 August 1965
       Name       Relation  Age         Birthdate
5     Suman    Grandmother   80  21 November 1942
1    Kishor         Father   62      11 July 1957
2   Vandana         Mother   54    30 August 1965
4    Ashish        Brother   30     23 April 1989
3  Anushree  Sister-in-law   25      5 April 1997
0  Harshita           Self   21    22 August 1999
6  Harshita           Self   20    22 August 1999
7  Harshita           Self   20    22 August 1999
8  Harshita           Self   20    22 August 1999
9  Harshita           Self   20    22 August 1999
       Name       Relation  Age         Birthdate
0  Harshita           Self   21    22 August 1999
1    Kishor         Father   62      11 July 1957
2   Vandana         Mother   54    30 August 1965
3  Anushree  Sister-in-law   25      5 April 1997
4    Ashish        Brother   30     23 April 1989
5     Suman    Grandmother   80  21 November 1942
6  Harshita           Self   20    22 August 1999
7  Harshita           Self   20    22 August 1999
8  Harshita           Self   20    22 August 1999
9  Harshita           Self   20    22 August 1999

**PRoblem Statement 1 : Create a Data Frame of your name for S.E. mark sheet using column name as 'Subject Name', 'Marks', 'Semester' for minimum 8 subjects. 1)Calculate the percentage that you secured in S.E. mark sheet 2) Display first 3 records of the Data Frame 3) Display last 2 records of the Data Frame**

In [ ]:
import pandas as pd
data = [['DS', 45, 3],
        ['COA', 42, 3],
        ['DELD', 40, 3],
        ['Engineering Mathematics 3', 48, 3],
        ['CG', 95, 3],
        ['PSSOP', 46, 4],
        ['DSF', 41, 4],
        ['PAI', 48 , 4]]
Harshita = pd.DataFrame(data, columns = ['Subject Name', 'Marks', 'Semester'])
print(Harshita)
percentage = (Harshita['Marks'].sum()/800)* 100
print(percentage)
print(Harshita.head(3))
print(Harshita.iloc[-2:])

                Subject Name  Marks  Semester
0                         DS     45         3
1                        COA     42         3
2                       DELD     40         3
3  Engineering Mathematics 3     48         3
4                         CG     95         3
5                      PSSOP     46         4
6                        DSF     41         4
7                        PAI     48         4
50.625
  Subject Name  Marks  Semester
0           DS     45         3
1          COA     42         3
2         DELD     40         3
  Subject Name  Marks  Semester
6          DSF     41         4
7          PAI     48         4

**Problem Statement 3 : Create a Data Frame for Districts from India with column name as 'District Name', 'Population','State' with some null values. Prepare total 15 records. Out of which randomly put null values in maximum 5 records. Perform the following operations on it, 1) Convert the data type of population from float to integer 2) Replace all null values to 1. 3) Rename the column name 'District Name' to 'Name of the District' 4) Set the index for Data Frame**

In [1]:
import pandas as pd
import numpy as np
data = [['Pune', 3000000, 'MH'],['Thane', np.nan, 'MH'], ['Aurangabad', 100000, 'MH'], ['Bhopal', 200000, 'MP'], ['Hoshangabad', 100000, 'MP'], ['Indore', 1500000, 'MP'], ['Chennai', 120000, 'TN'], ['Solhapur', np.nan, 'MH'], ['Sangli', 100000, 'MH'], ['Jabalpur', 120000, 'MP'], ['Satara', 140000, 'MH'], ['Devas',np.nan, 'MP'], ['Budhni', 100000, 'MP'], ['Kolhapur', np.nan, 'MH'], ['Gandhinagar', 120000, 'GUJ'], ['Bhilai', np.nan, 'MP']]
df = pd.DataFrame(data, columns = ['District Name', 'Population', 'State'])
df

   District Name  Population State
0           Pune   3000000.0    MH
1          Thane         NaN    MH
2     Aurangabad    100000.0    MH
3         Bhopal    200000.0    MP
4    Hoshangabad    100000.0    MP
5         Indore   1500000.0    MP
6        Chennai    120000.0    TN
7       Solhapur         NaN    MH
8         Sangli    100000.0    MH
9       Jabalpur    120000.0    MP
10        Satara    140000.0    MH
11         Devas         NaN    MP
12        Budhni    100000.0    MP
13      Kolhapur         NaN    MH
14   Gandhinagar    120000.0   GUJ
15        Bhilai         NaN    MP

In [4]:
df['Population'] = df['Population'].fillna(1)
df

   Name of District  Population State
0              Pune   3000000.0    MH
1             Thane         1.0    MH
2        Aurangabad    100000.0    MH
3            Bhopal    200000.0    MP
4       Hoshangabad    100000.0    MP
5            Indore   1500000.0    MP
6           Chennai    120000.0    TN
7          Solhapur         1.0    MH
8            Sangli    100000.0    MH
9          Jabalpur    120000.0    MP
10           Satara    140000.0    MH
11            Devas         1.0    MP
12           Budhni    100000.0    MP
13         Kolhapur         1.0    MH
14      Gandhinagar    120000.0   GUJ
15           Bhilai         1.0    MP

In [3]:
df['Population'] = df['Population'].fillna(1)
df

   Name of District  Population State
0              Pune   3000000.0    MH
1             Thane         1.0    MH
2        Aurangabad    100000.0    MH
3            Bhopal    200000.0    MP
4       Hoshangabad    100000.0    MP
5            Indore   1500000.0    MP
6           Chennai    120000.0    TN
7          Solhapur         1.0    MH
8            Sangli    100000.0    MH
9          Jabalpur    120000.0    MP
10           Satara    140000.0    MH
11            Devas         1.0    MP
12           Budhni    100000.0    MP
13         Kolhapur         1.0    MH
14      Gandhinagar    120000.0   GUJ
15           Bhilai         1.0    MP

In [ ]:
df.Population.astype(int)

0     3000000
1           1
2      100000
3      200000
4      100000
5     1500000
6      120000
7           1
8      100000
9      120000
10     140000
11          1
12     100000
13          1
14     120000
15          1
Name: Population, dtype: int64

In [2]:
df.rename(columns = {'District Name' : 'Name of District'}, inplace = True )
df

   Name of District  Population State
0              Pune   3000000.0    MH
1             Thane         NaN    MH
2        Aurangabad    100000.0    MH
3            Bhopal    200000.0    MP
4       Hoshangabad    100000.0    MP
5            Indore   1500000.0    MP
6           Chennai    120000.0    TN
7          Solhapur         NaN    MH
8            Sangli    100000.0    MH
9          Jabalpur    120000.0    MP
10           Satara    140000.0    MH
11            Devas         NaN    MP
12           Budhni    100000.0    MP
13         Kolhapur         NaN    MH
14      Gandhinagar    120000.0   GUJ
15           Bhilai         NaN    MP

**Problem Statement 5: Create two series with 'first name' and 'surname' consist of 5 integer numbers (randomly take some positive and negative integers) each and display the 'Addition' and 'Multiplication' output of the two series**

In [ ]:
import pandas as pd
import numpy as mp
data1 = np.array([10,20,30,40,50])
ser1 = pd.Series(data1)
data2 = np.array([4,5,6,-9,3,-3])
ser2 = pd.Series(data2)
Series3 = ser1 + ser2 
print(Series3)
Series4 = ser1 * ser2
print(Series4)

0    14.0
1    25.0
2    36.0
3    31.0
4    53.0
5     NaN
dtype: float64
0     40.0
1    100.0
2    180.0
3   -360.0
4    150.0
5      NaN
dtype: float64